app/controllers/alarms_controller.rb

SELECT "alarms".* FROM "alarms"
---
  def index
    @alarms = Alarm.all

INSERT INTO "alarms" ("username", "word", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "이수진"], ["word", "마우스"], ["title", "[마우스 키워드 알람]"], ["description", "어쩌구님 - 마우스팔아요~"], ["created_at", "2021-08-20 11:32:13.822801"], ["updated_at", "2021-08-20 11:32:13.822801"]]
---
  def create
    @alarm = Alarm.new(alarm_params)

    respond_to do |format|
      if @alarm.save

DELETE FROM "alarms" WHERE "alarms"."id" = ?  [["id", 5]]
---
  def destroy
    @alarm.destroy

SELECT "alarms".* FROM "alarms" WHERE "alarms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_alarm
      @alarm = Alarm.find(params[:id])