app/controllers/keywords_controller.rb

SELECT "keywords".* FROM "keywords"
---
  def index
    @keywords = Keyword.all

INSERT INTO "keywords" ("username", "word", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "sujin"], ["word", "아이패드"], ["created_at", "2021-08-20 11:08:51.022263"], ["updated_at", "2021-08-20 11:08:51.022263"]]
---
  def create
    @keyword = Keyword.new(keyword_params)

    respond_to do |format|
      if @keyword.save

DELETE FROM "keywords" WHERE "keywords"."id" = ?  [["id", 5]]
---
  def destroy
    @keyword.destroy

SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_keyword
      @keyword = Keyword.find(params[:id])