app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("username", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "lee"], ["title", "맥북마우스아이패드애플펜슬"], ["description", "test"], ["created_at", "2021-08-25 04:54:02.963365"], ["updated_at", "2021-08-25 04:54:02.963365"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "성공했다~!!"], ["updated_at", "2021-08-20 10:42:16.067937"], ["id", 19]]