app/controllers/posts_controller.rb

INSERT INTO "posts" ("username", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "이수진"], ["title", "맥북아이패드마우스애플펜슬"], ["description", "test"], ["created_at", "2021-08-24 13:47:36.338944"], ["updated_at", "2021-08-24 13:47:36.338944"]]
SELECT DISTINCT (username) FROM "keywords" WHERE "keywords"."word" = ?  [["word", "아이패드"]]
SELECT DISTINCT (word) FROM "keywords"
---
  def create
    @post = Post.new(post_params)
	post = @post
    respond_to do |format|
      if @post.save
		# 알람받을 대상 선정 알고리즘

		  # 1) keyword 중복없이 조회
		  keywords = Keyword.select("DISTINCT (word)")
		  alert_keywords = Hash.new
		  tmp_keywords = []
		  whole_users = []

		  # 2) 반복하여 keywords 원소 게시글 키워드매칭
		  keywords.each do |keyword|
			  if post.title.include? keyword.word
				  tmp_keyword_array = Keyword.select("DISTINCT (username)").where(word: keyword.word).all
				  alert_keywords[keyword.word] = []
				  tmp_keyword_array.each do |x|

UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "상태좋습니다~~!!!!"], ["updated_at", "2021-08-20 06:28:34.588032"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)