app/controllers/userpage_controller.rb

	def page
		@username = params[:username]
		@posts = Post.where(username: params[:username]).all
		@keywords = Keyword.where(username: params[:username]).all
		@alarms = Alarm.where(username: params[:username]).all
---
SELECT "posts".* FROM "posts" WHERE "posts"."username" = ?  [["username", "sujin"]]
SELECT "keywords".* FROM "keywords" WHERE "keywords"."username" = ?  [["username", "sujin"]]
SELECT "alarms".* FROM "alarms" WHERE "alarms"."username" = ?  [["username", "sujin"]]