app/jobs/alert_job.rb

  def perform(data)
	parsed = JSON.parse(data)
    alarm = Alarm.new
	alarm.username=parsed["username"]
	alarm.word=parsed["word"]
	alarm.title=parsed["title"]
	alarm.description=parsed["description"]
	alarm.save
---
INSERT INTO "alarms" ("username", "word", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "sujin"], ["word", "맥북"], ["title", "[맥북 키워드알람]"], ["description", "이수진님의 글제목:맥북"], ["created_at", "2021-08-21 10:55:18.816527"], ["updated_at", "2021-08-21 10:55:18.816527"]]